
const log = console.log;
let a; // Оголосила змінну
a = 15; // Присвоїла значення змінній, тип - number
let str = "text"; //Оголосила та одразу присвоїла значення, тип - string
const isPaid = true; // Оголосила та присвоїла значення, тип - boolean
let empty = null; // Оголосила та присвоїла значення, тип - null
let b; // Оголосила змінну, але не буду присвоювати їй значення, щоб при виводі в консоль отримати undefined
//або
let c = undefined; //Оголосила змінну та одразу присвоїла значення, тип - undefined

log(a, str, isPaid, empty, b, c); // Вивожу в консоль
